InformationRegisters/УсловияСделок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>УсловияСделок</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Отменено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДепозитарныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеСчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютаОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СобственныйКурсОплаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КурсОплаты</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КурсОплаты</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаПроцент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦенаПроцент</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлатежноеУсловиеСделки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОтложенноеИсполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаздельноеИсполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Сделка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/УсловияСделок/Ext/ManagerModule.bsl
Процедура СформироватьДвижения(Сделка) Экспорт

	Сделка.Движения.УсловияСделок.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Сделка.Дата КАК Период,
		|	Сделка.Организация КАК Организация,
		|	Сделка.Ссылка КАК Сделка,
		|	Сделка.Рынок КАК Рынок,
		|	СделкаЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ЛОЖЬ КАК Отменено,
		|	СделкаЦенныеБумаги.ДепозитарныйСчет КАК ДепозитарныйСчет,
		|	ВЫБОР
		|		КОГДА Сделка.ОтложенноеИсполнение
		|			ТОГДА Сделка.ДатаИсполнения
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(Сделка.Дата, ДЕНЬ)
		|	КОНЕЦ КАК ДатаИсполнения,
		|	ВЫБОР
		|		КОГДА Сделка.ОтложенноеИсполнение
		|			ТОГДА ВЫБОР
		|					КОГДА Сделка.РаздельноеИсполнение
		|						ТОГДА Сделка.ДатаОплаты
		|					ИНАЧЕ Сделка.ДатаИсполнения
		|				КОНЕЦ
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(Сделка.Дата, ДЕНЬ)
		|	КОНЕЦ КАК ДатаОплаты,
		|	ВЫБОР
		|		КОГДА Сделка.ОтложенноеИсполнение
		|			ТОГДА ВЫБОР
		|					КОГДА Сделка.РаздельноеИсполнение
		|						ТОГДА Сделка.ДатаПоставки
		|					ИНАЧЕ Сделка.ДатаИсполнения
		|				КОНЕЦ
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(Сделка.Дата, ДЕНЬ)
		|	КОНЕЦ КАК ДатаПоставки,
		|	Сделка.ВалютаОплаты КАК ВалютаОплаты,
		|	Сделка.СобственныйКурсОплаты КАК СобственныйКурсОплаты,
		|	Сделка.КурсОплаты КАК КурсОплаты,
		|	СделкаЦенныеБумаги.Количество КАК Количество,
		|	СделкаЦенныеБумаги.Цена КАК Цена,
		|	СделкаЦенныеБумаги.ЦенаПроцент КАК ЦенаПроцент,
		|	СделкаЦенныеБумаги.ЦенаКупона КАК ЦенаКупона,
		|	СделкаЦенныеБумаги.Сумма КАК Сумма,
		|	СделкаЦенныеБумаги.СуммаКупона КАК СуммаКупона,
		|	Сделка.ОтложенноеИсполнение КАК ОтложенноеИсполнение,
		|	Сделка.РаздельноеИсполнение КАК РаздельноеИсполнение,
		|	Сделка.ПлатежноеУсловиеСделки КАК ПлатежноеУсловиеСделки
		|ИЗ
		|	Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка КАК Сделка
		|		ПО СделкаЦенныеБумаги.Ссылка = Сделка.Ссылка
		|ГДЕ
		|	Сделка.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	СделкаЦенныеБумаги.НомерСтроки";

	Запрос.УстановитьПараметр("Ссылка", Сделка.Ссылка);

	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Сделка.Движения.УсловияСделок.Добавить(), Выборка);
	КонецЦикла;
	
КонецПроцедуры // СформироватьДвижения
